"""
Დაწერეთ პროგრამა რომელიც არგუმენტად მიიღებს მანქანის სიჩქარეს,
განსაზღვრავს მისი სიჩქარის კატეგორიას და დაბეჭდავს ეკრანზე. 
Სიჩქარისკატეგორიები განისაზღვრება შემდეგნაირად. 
Თუ ავტომობილის სიჩქარე 30 კმ/სთ-ზე ნაკლებია; 
მისი კატეგორიაა - SLOW. 
Როცა ავტომობილის სიჩქარე 120 კმ/სთ-ზემეტია;
მისი კატეგორიაა - VERY FAST.
Თუ ავტომობილის სიჩქარე მეტია 60 კმ/სთ-ზე,მისი კატეგორიაა - FAST.
Ხოლო თუ ავტომობილის სიჩქარე მეტია 30 კმ/სთ-ზე, მისიკატეგორიაა - MODERATE.
(თუ ავტომობლი ხვდება ორ კატეგორაიში, უნდა შეირჩესუფრო სწრაფი კატეგორია)

"""