"""
4.	*დაწერეთ პროგრამა რომელიც მომხმარებლის შემოყვანილ ტექსტს დაშიფრავს ან განშიფრავს და დაბეჭდავს ეკრანზე. Ნებისმიერი სიმბოლო რომელიც არ მიეკუთვნება a-z დატოვეთ უცვლელი.
დაშიფვრის ლოგიკა ასეთია, ყოველი სიმბოლო(a-z) უნდა შეიცვალოს კლავიატურაზე მის მარჯვნივ მდგომი სიმბოლოთი. Თუ სიმბოლოს მარჯვნივ კლავიატურაზე ინგლისური სიმბოლო არ არის, მაშინ უნდა გადავიდეს პირველ სიმბოლოში ამ სტრიქონიდან. Მაგალითად: p -> q, l -> a და ა.შ.

პროგრამამ უნდა გარდაქმნას მხოლოდ დაბალი რეგისტრის ინგლისური სიმბოლოები a-z. 
Მაგ. 1:
Enter action (e/d): e
Enter text: power
qpert

მაგ. 2:
Enter action (e/d): d
Enter text: quyjpm
python






"""