"""
2. დაწერეთ ფუნქცია midpoint(x1, y1, x2, y2). 
1) Ფუნქციამ უნდა გამოითვალოს x და y წერთილების შუა წერტილი და 
tuple-ის სახით დააბრუნოს. Შუაწერტილის გამოთვლის ფორმულა შემდეგია: 
( (x1 + x2) / 2 , (y1 + y2) / 2). 

2) Გამოიძახეთ თქვენს მიერ შექმნილი ფუნქცია main ში რამდენჯერმე 
სხვადასხვა პარამეტრებით და აჩვენეთ თქვენი ფუნქციის მუშაობა.
"""

def midpoint(x1, y1, x2, y2):
   result = ( (x1 + x2) / 2 , (y1 + y2) / 2)
   return (result)

def main():
    print(midpoint(20, 40, 10, 5))
    print(midpoint(-3, -7, 6, 5)) 
if __name__ == "__main__":
    main()